.config/doom/config.org
#+TITLE: geekodour's fucktacular emacs config
#+AUTHOR: Hrishikesh Barman
#+PROPERTY: header-args :tangle config.el

This config is the definition of anti-pragmatism and idiocrasy.

* Useful links
** emacs
- [[https://docs.doomemacs.org/latest/][Doom Emacs v21.12 documentation]]
- [[https://emacsdocs.org/][Hello from Emacs Docs | Emacs Docs]]
** org-mode
- [[https://www.youtube.com/watch?v=0g9BcZvQbXU][Consistent Technical Documents Using Emacs and Org Mode - YouTube]]
- [[https://github.com/james-stoup/emacs-org-mode-tutorial][james-stoup/emacs-org-mode-tutorial]]
- [[https://orgmode.org/worg/org-hacks.html][Org ad hoc code, quick hacks and workarounds]]
- [[https://orgmode.org/worg/doc.html][Documentation for Org hooks, commands and options]]
- [[https://olmon.gitlab.io/org-themes/][Org Themes collection]]
** Others
- [[https://github.com/noctuid/evil-guide#does-emacs-have-vim-like-tabs-distinct-window-configurations=][noctuid/evil-guide: Draft of a guide for using emacs with evil]]
- [[https://github.com/chrisdone/elisp-guide][elisp-guide: A quick guide to Emacs Lisp programming]]
* Fix now
- [ ] Create workspaces for locus, for config etc.
- [ ] Learn how to properly set keybindings (It's a mess rn)
- [ ] Learn hooks
- [ ] Learn sessions
- [ ] Learn emacs code review
- [ ] Learn macros
- [ ] oxhugo export/all function is slow. Make it git aware so it only picks org files that are git dirty. Maybe an option.
- [ ] Enable treesitter for all languages
- [X] Disable =potery-tracking-mode=
- [ ] Fix emacs session save and restore. Autosave is werid.
- [ ] [[https://www.reddit.com/r/DoomEmacs/comments/mfr0ed/how_can_i_disable_format_onsave_on_specific/][Prettier Fix ]]
- [ ] I want to be able to select a bunch of text and slap a link on it. Currently I do manual =]][[]<paste>][]<forward>][<backward>[]]= kind of shit which kills me a little inside.
- [ ] Learn 3 way merging, [[https://www.gnu.org/software/emacs/manual/html_node/ediff/Merging-and-diff3.html][Merging and diff3 (Ediff User’s Manual)]]
* Fix later
- [ ] Currently the config file is based on emacs semantics, eg. local vars, hooks etc. This way of configuring seems to be a bad choice in hindsight but I do not have the time to reshuffle things atm plus some things are mixed. Come back and fix this shit when you're free.
- [ ] Play with org-ql to get more things out of org-mode. I honestly have no need to do so.

* Look and feel
** Fonts and Theme
#+begin_src elisp
(setq
 doom-font (font-spec :family "JetBrains Mono Nerd Font" :size 13)
 ;; doom-font (font-spec :family "FiraCode Nerd Font Mono" :size 13)
 doom-theme 'doom-tokyo-night
 doom-themes-treemacs-theme "doom-colors"
 )
#+end_src
** Line numbers and other mini mods
#+begin_src elisp
(setq
 display-line-numbers-type 'relative
 magit-revision-show-gravatars '("^Author:     " . "^Commit:     ")
 )
#+end_src
** Splash screen
#+begin_src elisp
(setq
 fancy-splash-image (concat doom-user-dir "splash/mario.png")
 +doom-dashboard-functions '(doom-dashboard-widget-banner doom-dashboard-widget-loaded)
 )
#+end_src

* Setting variables
- If a variable is not =buffer-local=, then =setq= and =setq-default= do the same thing.
- If a variable is =buffer-local=
  - =setq= sets its local value in the current buffer
  - =setq-default= sets the global default value
** Local variables
*** User info
#+begin_src elisp
(setq
 user-full-name "Hrishikesh Barman"
 user-mail-address "hrishikeshbman@gmail.com"
 )
#+end_src
*** org-mode and org-roam
#+begin_src elisp
(setq
 org-directory "~/notes/org/"
 org-roam-directory "~/notes/org/roam" ; expects the directory to exist
 org-agenda-files '("~/notes/org/tasks.org" "~/notes/org/l.org" "~/locus/o/content-org/anti_lib.org") ; it looks for files with .org extensions
 org-roam-mode-sections '(org-roam-backlinks-section org-roam-reflinks-section) ;; TODO: Maybe we don't need this
 ;; journal
 org-journal-date-prefix "#+title: "
 org-journal-time-prefix "* "
 org-journal-file-header 'cf/org-journal-date-prefix
 org-journal-date-format "%a, %d-%m-%y"
 org-journal-file-format "%d_%m_%Y.org" ; important to have the .org otherwise org-agenda does not pick the todos
 )
#+end_src
*** deft
#+begin_src elisp
(setq
 deft-directory "~/notes/org"
 deft-recursive t
 deft-recursive-ignore-dir-regexp "\\(?:\\.\\|\\.\\.\\|roam\\|journal\\)"
 deft-use-filename-as-title t
 deft-strip-summary-regexp "\\(.*\\)"
 )
#+end_src
*** Misc
#+begin_src elisp
(setq
 poetry-tracking-strategy 'projectile
 )
#+end_src
** Default variables
#+begin_src elisp
(setq-default
 ;;x-stretch-cursor t ; stretch cursor to the glyph width
 evil-want-fine-undo t  ; by default while in insert all changes are one big blob. Be more granular
 auto-save-default nil ; auto save creates a lot of issues for me.
 truncate-string-ellipsis "…"  ; unicode ellispis are nicer than "..."
 shell-file-name "/bin/bash" ; org-anki has issues with fish shell because of no heredoc support, for now I don't really need fish
 )
#+end_src
** Environment variables
#+begin_src elisp
(setenv "XDG_SESSION_TYPE" "wayland") ;; for some reason emacs does not pick this up so we set it up manually
#+end_src
* Package configurations
See: [[https://github.com/doomemacs/doomemacs/blob/master/docs/getting_started.org#configuring-doom][doomemacs/getting_started.org]]
** Package initializations
These use ~use-package!~. It declares and configures a package.
*** tree-sitter
- If ever face issues w =tsx= check [[https://vxlabs.com/2022/06/12/typescript-development-with-emacs-tree-sitter-and-lsp-in-2022/][this]]
#+begin_src elisp
(use-package! tree-sitter
  :config
  (global-tree-sitter-mode)
  (require 'tree-sitter-langs)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
#+end_src
*** code formatting
- [[https://github.com/doomemacs/doomemacs/pull/6369][doomemacs/doomemacs#6369 refactor(format): replace with apheleia by elken]]
- if formatter is not found it will just quit quietly
#+begin_src elisp
(use-package! apheleia
  :config
  (apheleia-global-mode +1)
  (setf (alist-get 'python-mode apheleia-mode-alist)
        '(isort black)))
(push '(sh-mode . shfmt) apheleia-mode-alist) ; apheleia for some reason does not already do this
#+end_src

*** code checking and grammar
- I am not using =flycheck=, instead going plain =flaymake= + =eglot= and other =flymake= backends as needed. Nice combo. =SPC-c-x=
- https://github.com/mohkale/flymake-collection#configurations
#+begin_src elisp
(add-hook! prog-mode #'flymake-mode) ; start flymake-mode by default only for programming language
(setq
 eglot-stay-out-of nil
 )
(map!
 (:leader :desc "Enable vale" "t V" #'flymake-vale-maybe-load)) ; no way to toggle apparently
#+end_src
*** spell checking
- For spellchecking, emacs has =ispell= (interactive spelling) and =flyspell= (spelling on the fly).
- I wanted to use =enchant-2= as the middle man but =enchant-2= [[https://bugs.archlinux.org/task/68499][warns about]] optional deps.
- So it's just =hunspell= for me.
*** Misc packages inits
#+begin_src elisp
(use-package! nyan-mode
  :config
  (nyan-mode))

(use-package! flymake-popon
  :config
  (global-flymake-popon-mode))

(use-package! org-appear
  :after org
  :hook (org-mode . org-appear-mode)
  :config (setq
           org-appear-autolinks t
           org-appear-autoentities t
           org-appear-autosubmarkers t
           ))

;; TODO: This needs to be configured properly
(use-package! org-transclusion
  :after org-roam
  )

(use-package! websocket
    :after org-roam) ;; Needed for org-roam-ui
(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(use-package! org-super-agenda
  :hook (org-agenda-mode . org-super-agenda-mode)
)
#+end_src
** Package tweaking
These use ~after!~. It evaluates body after package has loaded.
*** LSP
I am using [[https://github.com/joaotavora/eglot][eglot]] instead of =lsp-mode=, it has less bells and whistles but it's more emacs native.
- =clangd= : c like languages
  - [[https://github.com/clangd/clangd/issues/45][clangd/clangd#45 Support non-self-contained files]]
- =pyright= : python
**** eldoc issues
- eldoc showing escape sequences (noticed in python, pyright lsp atleast)
  - =pyright= team only guarantee to target the markdown renderer supported by the VSCode LSP client. =eglot-prefer-plaintext= should help w pyright as of the moment. This will show everything in plain text, but that's fine for me.
  - =pyright= will not always show docstrings if they're not in the stub. See [[https://github.com/microsoft/pyright/issues/3632][this]] for more info.
  - But the extra =__= are [[https://github.com/jrblevin/markdown-mode/issues/661][still an issue]] w =clangd=
- eglot messes w yasnippet. fix added as suggested [[https://stackoverflow.com/questions/72601990/how-to-show-suggestions-for-yasnippets-when-using-eglot][here]]. works fine!
#+begin_src elisp
(setq eglot-prefer-plaintext t)
(setq-default eglot-workspace-configuration '((:gopls . ((gofumpt . t)))))

(add-hook 'eglot-managed-mode-hook (lambda ()(add-to-list 'company-backends '(company-capf :with company-yasnippet))))
#+end_src
****
**** lsptreemacs
There's something very neat about symbol trees. I like them but unfortunately I can't have them. Why you may ask.
- [[https://github.com/joaotavora/eglot/issues/614][Support for call hierarchies · Issue #614 · joaotavora/eglot · GitHub]]
- [[https://github.com/emacs-lsp/lsp-treemacs][GitHub - emacs-lsp/lsp-treemacs: lsp-mode treemacs]] (lsp-mode only)
**** dap-mode
=dap-mode= currently not supported for =eglot=, See [[https://www.reddit.com/r/emacs/comments/y2s13n/eglot_as_lsp_interface_dap/][this]] and [[https://github.com/emacs-lsp/dap-mode/issues/2][this]].
*** org-mode
**** General
#+begin_src elisp
(after! org
  (setq
   org-tags-column 0
   org-element-use-cache nil ; emacs doesn't let me save files or exit emacs otherwise, emacs bug. follow up.
   org-auto-align-tags t
   org-hide-emphasis-markers t
   org-fold-catch-invisible-edits 'show-and-error
   org-insert-heading-respect-content t
   org-pretty-entities t
   org-ellipsis "…"
   org-image-actual-width 300
   org-complete-tags-always-offer-all-agenda-tags t
   ))
#+end_src
**** Look and feel
#+begin_src elisp
(after! org
  (custom-set-faces!
    '(org-level-1 :height 1.2 :weight extrabold :slant normal)
    '(org-level-2 :height 1.1 :weight bold :slant normal)
    '(org-level-3 :height 1.0 :weight bold :slant normal)
    '(org-document-title :height 180 :weight medium :family "Roboto")
    ))
#+end_src
**** org-todo
#+begin_src elisp
(after! org
  (setq
   org-todo-keywords
   '(
     ;;tasks
     (sequence "TODO(t)" "INPROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")
     ;;media
     (sequence "TOCONSUME" "CONSUMING" "|" "FINISHED" "DROPPED")
     ;;items
     (sequence "TOACQUIRE" "|" "ACQUIRED")
     ;;projects
     (sequence "SEED" "SAPLING" "GROWING" "|" "GROWN" "DIED")
     )
   ))
#+end_src
*** org-capture templates
#+begin_src elisp
(after! org
  (setq org-capture-templates `(
#+end_src
