.config/doom/config.org
*** org-babel
This mostly works out of the box but apparently the extensions are somewhat fucked when we try to tangle. So explicitly specifying the extensions.
#+begin_src elisp
(after! org
  (add-to-list 'org-babel-tangle-lang-exts '("python" . "py"))
  (add-to-list 'org-babel-tangle-lang-exts '("rust" . "rs"))
  (add-to-list 'org-babel-tangle-lang-exts '("ocaml" . "ml"))
  (add-to-list 'org-babel-tangle-lang-exts '("go" . "go")))
#+end_src
*** ox-reveal (disabled)
This is downloaded but I don't make slides daily so I can enable this when I need it. Doesn't slow down things too much but why free load.
#+begin_src elisp :tangle no
(eval-after-load 'org-mode
  '(load-library "ox-reveal"))
#+end_src
*** projectile
These things are supposed to be emphemeral, not something you want to check in vcs. So work with these w that mindset.
- =session=
  - Set of open =workspaces=
  - =~/.emacs.d/.local/etc/workspaces/autosave= (where auto sessions are stored)
  - Keybindings: =SPC-q-*=
  - Will saving a session also save a workspace even if the workspace is not saved?
- =workspace=
  - Set of =projects=
  - emacs add support for =workspaces= via [[https://github.com/Bad-ptr/persp-mode.el][persp-mode]]. So =workspace= same as =perspective=
  - Keybindings: =SPC-TAB-*=
  - [[https://docs.doomemacs.org/v21.12/modules/ui/workspaces/][:ui workspaces - Doom Emacs v21.12 documentation]]
- =project=
  - Set of files, either signified via =vcs= repo or by including =.projectile= file.
  - emacs add support for project wide operations via [[https://github.com/bbatsov/projectile][projectile]]
- Treemacs
  - A sidebar
  - Shows =workspaces/prespective= and =projects=
  - You can add non-projectile projects to treemacs too. (=C-c C-p a= vs =C-c C-p p=)
  - =~/.emacs.d/.local/etc/workspaces/_workspaces=
    - When you save workspaces, this is where it gets saved.
    - Technically since this is a set of workspaces, which means it is a =session=. =SPC-q-*= allows you to load this, which basically loads all your saved workspaces.
    - This just saves the =workspace/prespective= name, the mapping is stored in =treemacs-persist=
    - While saving, w =SPC-TAB-s= you might encounter a prompt whether to overwrite existing saved workspaces or add it along.
  - =~/.emacs.d/.local/cache/treemacs-persist=
    - The cache for =project= - =workspace= mapping
    - It's what we get when you do =treemacs-edit-workspaces=
#+begin_src elisp
(after! projectile
  (setq
   projectile-project-search-path '("~/projects" "~/locus" "~/infra" "~/faafo")
   +workspaces-on-switch-project-behavior nil)

  (projectile-add-known-project "~/.config/") ; not a git repo but has a .projectile
  (projectile-add-known-project "~/notes/"))
#+end_src
*** tabs (disabled)
I no longer use tabs, long live buffers.
#+begin_src elisp :tangle no
(after! centaur-tabs
  (setq centaur-tabs-set-bar 'under) ; see https://github.com/ema2159/centaur-tabs/issues/127
  (centaur-tabs-group-by-projectile-project)) ; see https://github.com/ema2159/centaur-tabs/issues/181
#+end_src
*** Misc packages tweaks
#+begin_src elisp
(after! which-key
  (setq which-key-popup-type 'minibuffer)) ;; default popup does not show full contents sometimes

(after! org-fancy-priorities
  (setq org-fancy-priorities-list '("🌕" "🌗" "🌙" "☕")))

(after! chatgpt-shell
  (setq chatgpt-shell-openai-key "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"))
#+end_src
* Mode hooks
** Python quirks
#+begin_src elisp
(add-hook 'python-mode-hook
          (lambda ()
            (setq-local python-shell-buffer-name
                        (format "Python %s" (buffer-file-name))
                        )))
#+end_src
*** Restart python v1 (disabled)
Source: [[https://lgmoneda.github.io/2017/02/19/emacs-python-shell-config-eng.html][A solution for the reload modules problem in Emacs Python Shell | lgmoneda]]
#+begin_src elisp :tangle no
;; Restart python console before evaluate buffer or region to avoid various
;; uncanny conflicts, like not reloding modules even when they are changed"
(defun restart-python-console ()
  (interactive)
  (kill-Python "process")
  (sleep-for 0.05)
  (kill-buffer "*Python*")
  (elpy-shell-send-region-or-buffer))
#+end_src
*** Restart python v2 (disabled)
#+begin_src elisp :tangle no
;; Restart python console before evaluate buffer or region to avoid various
;; uncanny conflicts, like not reloding modules even when they are changed"
(defun my-restart-python-console ()
  (interactive)
  (if (get-buffer (format "Python %s" (buffer-file-name))  )
      (let ((kill-buffer-query-functions nil)) (kill-buffer (format "Python %s" (buffer-file-name)))))
  (elpy-shell-send-region-or-buffer))
#+end_src

* Key bindings
** Global bindings (disabled)
#+begin_src elisp :tangle no
;; NOTE: I am not sure if I am even using these, so no tangle
(global-set-key (kbd "C-c C-x C-c") 'my-restart-python-console)
(global-set-key (kbd "C-S-v") #'paste-from-clipboard)
#+end_src

#+begin_src elisp
(map!
 (:leader :desc "insert node immediate" "n r k" #'cf/org-roam-node-insert-immediate)
 (:leader :desc "node complete" "n r c" #'completion-at-point)
 (:leader :desc "devdocs" "d")
 (:leader :desc "Open on point" "d o" #'devdocs-browser-open)
 (:leader :desc "Open on point for doc" "d i" #'devdocs-browser-open-in)
 (:leader :desc "Show available snippets" "m y" #'yas-describe-tables))
; TODO Need binding for treemacs workspace edit
#+end_src

** Package specific
This uses =with-eval-after-load=. It executes body after file/feature is loaded. See [[https://company-mode.github.io/manual/Getting-Started.html][Getting Started (Company User Manual)]]
*** Misc packages
#+begin_src elisp
(with-eval-after-load 'company
  (define-key company-mode-map (kbd "C-/") 'company-complete)
  )
#+end_src
*** org-mode specific packages
#+begin_src elisp
(use-package! org
  :mode ("\\.org\\'" . org-mode)
  :config
  (define-key org-mode-map (kbd "C-c C-r") verb-command-map))
  (setq verb-auto-kill-response-buffers t)

(use-package! org-web-tools
  :after org
  :demand t ; do not lazy load this
  :config
  (define-key evil-normal-state-map (kbd "SPC i l") #'org-web-tools-insert-link-on-point))
#+end_src

* Custom functions (cf)
NOTE: I am very inconsistent with the =cf= prefix. That needs some fixing someday.
** Export ox-hugo site
- Source: [[https://github.com/kaushalmodi/ox-hugo/discussions/585#discussioncomment-2335203][How to export all Org files in a directory + How to generate offline navigable HTML files using Hugo?]]
- Maybe allow optional single files to be exported
- Export Takes about 2m for ~200 files.
- This export exports everything and not only the changed files. Which is what we want sometimes if we commited things without exporting.
#+begin_src elisp
(defun cf/hugo-export-all (&optional org-files-root-dir dont-recurse)
  "Export all Org files (including nested) under ORG-FILES-ROOT-DIR.
Example usage in Emacs Lisp: (ox-hugo/export-all \"~/org\")."
  (interactive)
  (let* ((org-files-root-dir (or org-files-root-dir default-directory))
         (dont-recurse (or dont-recurse (and current-prefix-arg t)))
         (search-path (file-name-as-directory (expand-file-name org-files-root-dir)))
         (org-files (if dont-recurse
                        (directory-files search-path :full "\.org$")
                      (directory-files-recursively search-path "\.org$")))
         (num-files (length org-files))
         (cnt 1))
    (if (= 0 num-files)
        (message (format "No Org files found in %s" search-path))
      (progn
        (message (format (if dont-recurse
                             "[ox-hugo/export-all] Exporting %d files from %S .."
                           "[ox-hugo/export-all] Exporting %d files recursively from %S ..")
                         num-files search-path))
        (dolist (org-file org-files)
          (with-current-buffer (find-file-noselect org-file)
            (message (format "[ox-hugo/export-all file %d/%d] Exporting %s" cnt num-files org-file))
            (org-hugo-export-wim-to-md :all-subtrees)
            (setq cnt (1+ cnt))))
        (message "Done!")))))
#+end_src
** Export static stuff
#+begin_src elisp
(defun cf/export-static-html (file_path)
  (with-current-buffer (find-file-noselect file_path)
    (org-html-export-to-html)
    )
  (message "Done!"))
#+end_src
** Journal location
Source: =jparcill/emacs_config/blob/master/config.el=
#+begin_src elisp
(defun cf/org-journal-find-location ()
  ;; Open today's journal, but specify a non-nil prefix argument in order to
  ;; inhibit inserting the heading; org-capture will insert the heading.
  (org-journal-new-entry t)
  ;; Position point on the journal's top-level heading so that org-capture
  ;; will add the new entry as a child entry.
  (goto-char (point-min)))
#+end_src
** org-roam insert immediate
Source: [[https://systemcrafters.net/build-a-second-brain-in-emacs/5-org-roam-hacks/][5 Org Roam Hacks for Better Productivity in Emacs - System Crafters]]
#+begin_src elisp
(defun cf/org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t :unnarrowed t)))))
    (apply #'org-roam-node-insert args)))
#+end_src
** org-journal date prefix
#+begin_src elisp
(defun cf/org-journal-date-prefix (time)
  (let* (
         (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
         (year (format-time-string "%Y"))
         (month (format-time-string "%m"))
         )
    (mapconcat #'identity
               `("", (format "#+HUGO_SECTION: journal/%s/%s" year month),(concat "#+DATE: " date))
               "\n")))
#+end_src
