.config/doom/config.org
** ox-hugo new subtree post capture
Source: [[https://ox-hugo.scripter.co/doc/org-capture-setup/][Org Capture Setup — ox-hugo - Org to Hugo exporter]]
#+begin_src elisp
(defun org-hugo-new-subtree-post-capture-template ()
  "Returns `org-capture' template string for new Hugo post. See `org-capture-templates' for more information."
  (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
         (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
         (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
         (fname (org-hugo-slug title)))
    (mapconcat #'identity
               `(
                 ,(concat "* TODO " title)
                 ":PROPERTIES:"
                 ,(concat ":EXPORT_FILE_NAME: " fname)
                 ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                 ":END:"
                 "%?\n")                ;Place the cursor here finally
               "\n")))
#+end_src
** org-roam insert image
- TODO: Probably can make this function more dynamic in the directory selection then I can use it in many more places.
- Source: [[https://tony-zorman.com/posts/emacs-potpourri.html][A Potpourri of Emacs Tweaks · Tony Zorman]]
#+begin_src elisp
(defun slot/org-roam-insert-image ()
  "Select and insert an image at point."
  (interactive)
  (let* ((file-name (format "%s-%s.png"
                            (file-name-sans-extension (buffer-name))
                            (cl-random (expt 2 31))))
         (path (format "%s/%s/%s" org-roam-directory "images" file-name)))
    (let ((grim-exit (call-process "/usr/bin/fish" nil t nil "-c" (format "grim -g \"$(slurp)\" - | swappy -f - -o %s" path))))
      (when (= grim-exit 0)
        ;; ox-hugo needs the file prefix to properly set the path for the image when exported
        (insert (format "[[file:./images/%s]]" file-name)))
      )))
#+end_src
** org-web-tools link title fetch
- See [[https://github.com/alphapapa/org-web-tools/issues/38#issuecomment-1412616933][Feature: replace existing URLs in Org document · Issue #38 · alphapapa/org-web-tools · GitHub]]
- TODO: Update =replace-string= with appropriate methods
#+begin_src elisp
(defun org-web-tools-insert-link-on-point ()
  (interactive)
  (replace-string (thing-at-point 'url t) (org-web-tools--org-link-for-url (thing-at-point 'url t))))
#+end_src

* Other notes
** Tangle
- When you tangle things, if you change property ~#+PROPERTY: header-args :tangle <filename.ext>~, You need to =C-C C-c= on that line. Otherwise =C-c C-v t= will keep tangling to the old file. Pretty annoying, yeah.
